<template>
  <div>
    <p>
      Welcome to Star Wars Project!<br>
      It uses <a href="https://swapi.co/" target="_blank">The Star Wars API</a>
    </p>
    <h3>Нюансы разработки:</h3>
    <ol>
      <li>Учитывая, что в результирующих данных SW API у сущностей нет как такового свойства id, пришлось перед тем как складывать сущность в хранилище, отдельно вычислять id из свойства url</li>
      <li>Заметил, что и список фильмов /films/, и единичный фильм /films/:id/ выводят одни и те же наборы свойств для фильма, то метод /films/:id/ для получения отдельного фильма я не использую, а беру нужный фильм из хранилища по заранее подготовленному айдишнику</li>
      <li>если пользователь «браузерно» рефрешит страницу /movies  или /movies/:id , то вначале заполняется хранилище. Затем при переходах по страницам к серверу не обращаемся, используем только данные из хранилища. Могут быть проблемы с устареванием данных, но в данном случае ок</li>
      <li>Использовал bootstrap CSS для красоты</li>
      <li>Использовал axios для общения с сервером</li>
    </ol>
  </div>
</template>

<script>
import SwMoviesList from '~/components/swMoviesList'

export default {
  components: {SwMoviesList}
}
</script>

<style>
</style>
